In [2]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(["PassengerId",'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 'columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target = df['Survived']
inputs = df.drop('Survived', axis='columns')

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs = pd.concat([inputs, dummies], axis = 'columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
inputs.drop('Sex', axis ='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [11]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [14]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [16]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [17]:
len(X_train)

712

In [18]:
len(X_test)

179

In [21]:
len(inputs)

891

In [22]:
X_train

     Pclass        Age      Fare  female  male
381       3   1.000000   15.7417       1     0
520       1  30.000000   93.5000       1     0
355       3  28.000000    9.5000       0     1
637       2  31.000000   26.2500       0     1
585       1  18.000000   79.6500       1     0
..      ...        ...       ...     ...   ...
139       1  24.000000   79.2000       0     1
104       3  37.000000    7.9250       0     1
307       1  17.000000  108.9000       1     0
200       3  28.000000    9.5000       0     1
166       1  29.699118   55.0000       1     0

[712 rows x 5 columns]

In [23]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [24]:
model.fit(X_train, y_train)

GaussianNB()

In [25]:
model.score(X_test, y_test)

0.8268156424581006

In [26]:
X_test[:10]

     Pclass        Age     Fare  female  male
869       3   4.000000  11.1333       0     1
820       1  52.000000  93.5000       1     0
634       3   9.000000  27.9000       1     0
271       3  25.000000   0.0000       0     1
176       3  29.699118  25.4667       0     1
801       2  31.000000  26.2500       1     0
303       2  29.699118  12.3500       1     0
668       3  43.000000   8.0500       0     1
627       1  21.000000  77.9583       1     0
588       3  22.000000   8.0500       0     1

In [27]:
y_test[:10]

869    1
820    1
634    0
271    1
176    0
801    1
303    1
668    0
627    1
588    0
Name: Survived, dtype: int64

In [30]:
model.predict_proba(X_test[:10])

array([[9.76946223e-01, 2.30537772e-02],
       [9.81751151e-04, 9.99018249e-01],
       [4.09953319e-02, 9.59004668e-01],
       [9.86854358e-01, 1.31456421e-02],
       [9.88050299e-01, 1.19497010e-02],
       [3.06971660e-02, 9.69302834e-01],
       [3.15455474e-02, 9.68454453e-01],
       [9.88178070e-01, 1.18219300e-02],
       [2.06783492e-03, 9.97932165e-01],
       [9.86922391e-01, 1.30776087e-02]])